require 'csv'

csv_text = ""

nicknames = ['가리온', '가은', '강다이', '고루나', '고운비', '그레','그리미', '글샘', '기찬', '길한','가든', '가람슬기', '가람휘', '나나','나도람', '나슬', '난새', '환판', '해샘찬', '해사랑해', '해련', '해님꽃','난한벼리', '나슬', '내누리', '누니', '늘새찬', '늘품', '늘해친','다보라', '다소나', '다솜', '다슴', '다올', '다조은', '달래울', '달비슬','대누리', '드레', '말그미', '모도리', '무아', '미리내', '미슬기', '바다','바로', '바우', '밞음이', '별아', '보다나', '봄이', '비치', '빛들','빛새온', '빛찬온', '사나래', '새라', '새미라', '새하', '샘나', '소담','소란', '솔다우니', '슬미', '아늘', '아로미', '아림', '아음', '애리','여슬', '영아름', '예달', '온비', '정다와', '정아라미', '조은', '지예','진아', '차니', '찬샘', '찬아름', '참이', '차미', '초은', '파라', '파랑','푸르나', '푸르내', '풀잎', '하나', '하나슬', '하리', '하은', '한','한비', '한아름', '해나', '해슬아', '희라', '자올']

Dir[File.join(Rails.root, 'lib/csv', 'user', '*.csv')].each { |csv| csv_text << File.read(csv) }

csv = CSV.parse(csv_text, :headers => true)
csv.each_with_index do |row, index|
  t = User.new
  t.email = row['email']
  t.password = row['password']
  t.nickname = nicknames[index]
  t.phone = row['phone']
  t.gender = row['gender']
  t.save
end
